{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.20.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "keras_layer", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_1", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/4"}, "name": "keras_layer_1", "inbound_nodes": [{"input_word_ids": ["keras_layer", 0, 2, {}], "input_mask": ["keras_layer", 0, 0, {}], "input_type_ids": ["keras_layer", 0, 1, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["keras_layer_1", 0, 13, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "BinaryAccuracy", "config": {"name": "accuracy", "dtype": "float32", "threshold": 0.5}}, {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of105.bin", "group1-shard2of105.bin", "group1-shard3of105.bin", "group1-shard4of105.bin", "group1-shard5of105.bin", "group1-shard6of105.bin", "group1-shard7of105.bin", "group1-shard8of105.bin", "group1-shard9of105.bin", "group1-shard10of105.bin", "group1-shard11of105.bin", "group1-shard12of105.bin", "group1-shard13of105.bin", "group1-shard14of105.bin", "group1-shard15of105.bin", "group1-shard16of105.bin", "group1-shard17of105.bin", "group1-shard18of105.bin", "group1-shard19of105.bin", "group1-shard20of105.bin", "group1-shard21of105.bin", "group1-shard22of105.bin", "group1-shard23of105.bin", "group1-shard24of105.bin", "group1-shard25of105.bin", "group1-shard26of105.bin", "group1-shard27of105.bin", "group1-shard28of105.bin", "group1-shard29of105.bin", "group1-shard30of105.bin", "group1-shard31of105.bin", "group1-shard32of105.bin", "group1-shard33of105.bin", "group1-shard34of105.bin", "group1-shard35of105.bin", "group1-shard36of105.bin", "group1-shard37of105.bin", "group1-shard38of105.bin", "group1-shard39of105.bin", "group1-shard40of105.bin", "group1-shard41of105.bin", "group1-shard42of105.bin", "group1-shard43of105.bin", "group1-shard44of105.bin", "group1-shard45of105.bin", "group1-shard46of105.bin", "group1-shard47of105.bin", "group1-shard48of105.bin", "group1-shard49of105.bin", "group1-shard50of105.bin", "group1-shard51of105.bin", "group1-shard52of105.bin", "group1-shard53of105.bin", "group1-shard54of105.bin", "group1-shard55of105.bin", "group1-shard56of105.bin", "group1-shard57of105.bin", "group1-shard58of105.bin", "group1-shard59of105.bin", "group1-shard60of105.bin", "group1-shard61of105.bin", "group1-shard62of105.bin", "group1-shard63of105.bin", "group1-shard64of105.bin", "group1-shard65of105.bin", "group1-shard66of105.bin", "group1-shard67of105.bin", "group1-shard68of105.bin", "group1-shard69of105.bin", "group1-shard70of105.bin", "group1-shard71of105.bin", "group1-shard72of105.bin", "group1-shard73of105.bin", "group1-shard74of105.bin", "group1-shard75of105.bin", "group1-shard76of105.bin", "group1-shard77of105.bin", "group1-shard78of105.bin", "group1-shard79of105.bin", "group1-shard80of105.bin", "group1-shard81of105.bin", "group1-shard82of105.bin", "group1-shard83of105.bin", "group1-shard84of105.bin", "group1-shard85of105.bin", "group1-shard86of105.bin", "group1-shard87of105.bin", "group1-shard88of105.bin", "group1-shard89of105.bin", "group1-shard90of105.bin", "group1-shard91of105.bin", "group1-shard92of105.bin", "group1-shard93of105.bin", "group1-shard94of105.bin", "group1-shard95of105.bin", "group1-shard96of105.bin", "group1-shard97of105.bin", "group1-shard98of105.bin", "group1-shard99of105.bin", "group1-shard100of105.bin", "group1-shard101of105.bin", "group1-shard102of105.bin", "group1-shard103of105.bin", "group1-shard104of105.bin", "group1-shard105of105.bin"], "weights": [{"name": "word_embeddings/embeddings", "shape": [30522, 768], "dtype": "float32"}, {"name": "position_embedding/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "type_embeddings/embeddings", "shape": [2, 768], "dtype": "float32"}, {"name": "embeddings/layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "embeddings/layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_0/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_0/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_1/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_1/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_2/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_2/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_3/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_3/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_4/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_4/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_4/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_4/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_5/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_5/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_5/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_5/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_6/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_6/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_6/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_6/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_7/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_7/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_7/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_7/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_8/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_8/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_8/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_8/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_9/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_9/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_9/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_9/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_10/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_10/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_10/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_10/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/attention_output/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention/attention_output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/self_attention_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "transformer/layer_11/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "transformer/layer_11/output/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "transformer/layer_11/output/bias", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "transformer/layer_11/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "pooler_transform/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "pooler_transform/bias", "shape": [768], "dtype": "float32"}, {"name": "Variable", "shape": [], "dtype": "bool"}, {"name": "output/kernel", "shape": [768, 1], "dtype": "float32"}, {"name": "output/bias", "shape": [1], "dtype": "float32"}]}]}